{
  "# open a shell and run these commands pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title@ code .":"# abrir una placa y ejecutar estos comandos pxt extraer https:\/\/codethemicrobit.com\/@id@ cd @title@ code .",
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). La experiencia tiene una progresión interna, de un sencillo editor de bloques, pasando por un editor de texto en browser con un robusto sistema de autocompletar y de autocorrección, hasta un ambiente de desarrollo integrado profesional (",
  ", or":", ou",
  "\/@id@":"\/@id@",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/thumbnail\/1024\/vimeo\/@ARGS@",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>Puedes compartir tus scripts habituales sin entrar con usuario.<\/b> Sólo necesitas entrar con usuario si deses publicar paquetes (bibliotecas) para que otros las utilicen. Para entrar con usuario, necesitarás una cuenta GitHub, que está disponible solamente para personas mayores de 13 años.",
  "@name@ \/@id@":"@name@ \/@id@",
  "@title@ @byuser@":"@title@ @byuser@",
  "About":"Sobre",
  "About PXT":"Sobre PXT",
  "Block Editor":"Editor de bloques",
  "Build your programming experience":"Construye tu experiencia de programación",
  "&nbsp; &nbsp; Documentation": "&nbsp; &nbsp; Documentación",
  "A JavaScript Blocks Editor": "Un editor JavaScript en Bloques",
  "Approved content": "Contenido aprobado",
  "Beta": "Beta",
  "C458ADC671C51F222A0F655F66596649": "C458ADC671C51F222A0F655F66596649",
  "CSV": "CSV",
  "Cancel": "Cancelar",
  "Circuit Playground Express": "Circuit Playground Express",
  "Click on <b>Close &amp; Load</b>.": "Pincha en <b>Cerrar &amp; cargar<\/b>.",
  "Click on <b>Data</b> » <b>New Query</b> » <b>From Other Sources</b> » <b>From Web</b>.": "Pincha en <b>Datos<\/b> » <b>Nueva consulta<\/b> » <b>De otras fuentes<\/b> » <b>De la Web<\/b>.",
  "Compatible with <b>BBC micro:bit<\/b>":"Compatible con <b>BBC micro:bit<\/b>",
  "Code": "Código",
  "Contact Us": "Contáctanos",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"Controla tu Kodu con la micro:bit! Pudes controlar el movimento del personaje utilizando el acelerómetro, saltar y tirar presionando los botones, mostrar animaciones y rodar textos en la pantalla, conectarte con otros dispositivos a través de las puertas de entrada/salida y mucho más..",
  "Create a <b>Blank Workbook</b> in Excel 2016": "Crie uma <b>pasta de trabalho em branco<\/b> no Excel 2016",
  "Do you need help installing the tools?":"Precisas ayuda para instalar las herramientas?",
  "Download Kodu!":"Download Kodu!",
  "Edit": "Editar",
  "Edit in":"Editar en",
  "Embed":"Embutir",
  "Enter the following URL and click on <b>Connect</b>.": "Digite la siguiente URL y pincha en <b>Conectar<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Espacio extra para una llamada de acción dentro que puede ayudar a un mayor comprometimiento de los usuarios.",
  "Follow these instructions!":"Siga estas instrucciones!",
  "Follow": "Seguir",
  "Fork me": "Fork me",
  "Get &amp; Transform": "Obtener &amp; transformar",
  "Get & Transform":"Obtener & Transformar",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Iniciar com un editor de código para iniciantes, amigable drag&amp;drop.",
  "GitHub":"GitHub",
  "Group 1":"Grupo 1",
  "Group 2":"Grupo 2",
  "Group 3":"Grupo 3",
  "Houston, we have a problem.":"Houston, tenemos un problema.",
  "I Agree":"Concuerdo",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Permito el uso de mi usuario GitHub <b>@USERNAME@<\/b> junto a cualquier biblioteca que yo publique",
  "I don't agree":"No concuerdo",
  "Go to editor": "Ir para el editor",
  "JSON": "JSON",
  "JavaScript Editor":"Editor JavaScript",
  "Kodu for micro:bit":"Kodu para micro:bit",
  "Learn more":"Aprenda más",
  "Link Four":"Link Cuatro",
  "Link One":"Link Uno",
  "Link Three":"Link Tres",
  "Link Two":"Link Dos",
  "Live data powered by": "Datos en tiempo real suministrados por",
  "Live data stream": "Flujo de datos en tiempo real",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Certifícate de haber salido de Facebook, Office 365, Microsoft o Google si estás en una computadora compartida.",
  "Microsoft MakeCode": "Microsoft MakeCode",
  "Mini": "Mini",
  "More info": "Más informaciones",
  "OK": "OK",
  "Page not found - Microsoft MakeCode": "Página no encontrada - Microsoft MakeCode",
  "Powered by Microsoft MakeCode": "Activado por Microsoft MakeCode",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name@",
  "PXT - @title@":"PXT - @title@",
  "PXT - Sign in":"PXT - Entrar",
  "PXT - Signed out":"PXT - Saliste",
  "PXT targets, including one for the BBC micro:bit, define a set of blocks and JavaScript APIs available to users. Teachers and developers can extend existing targets by publishing packages or libraries with additional blocks and APIs as well as build completely new targets.":"Objetivos PXT, incluyendo uno para la BBC micro:bit, definir un grupo de bloques y JavaScript APIs disponibles para usuarios. Profesores y desarrolladores pueden extender objetivos ya existentes publicando paquetes o bibliotecas con bloques o APIs adicionales, así como construir objetivos completamente nuevos.",
  "Powered by PXT":"Distribuído por PXT",
  "Privacy &amp; Cookies": "Privacidad &amp; Cookies",
  "Programming Experience Toolkit":"Kit de herramientas para experiencia de programación",
  "Programming Experience Toolkit Logo":"Logo del Kit de herramientas para experiencia de programación",
  "Published by Microsoft": "Publicado por Microsoft",
  "Read the docs":"Leer los documentos",
  "Report abuse": "Denunciar abuso",
  "Report sent": "Relatorio enviado",
  "Sample":"Muestra",
  "Select <b>Anonymous</b> and click <b>Connect</b>.": "Selecciona <b>Anónimo<\/b> y pincha en <b>Conectar<\/b>.",
  "Show me the sample!":"Muéstrame la muestra!",
  "Sign in":"Entrar",
  "Sorry, the page is missing": "Página no encontrada",
  "Start coding":"Iniciar código",
  "Stream: @name@": "Flujo de datos: @name@",
  "Stream: @title@": "Flujo de datos: @title@",
  "Streaming data in Excel 2016": "Datos de streaming en Excel 2016",
  "Submit": "Enviar",
  "Targets":"Objetivos",
  "Terms Of Use": "Términos de uso",
  "Thank you for helping keep Microsoft MakeCode a friendly place!": "Agradecemos tu ayuda para mantener el Microsoft MakeCode como un lugar amigable!",
  "Thank you for helping keep PXT a friendly place!":"Gracias por ayudar a mantener el PXT como un espacio amigable!",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"El Kit de herramientas para experiencia de programación de la Microsoft (PXT) brinda una experiencia de programación basada en JavaScript (técnicamente, un pedazo de",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"El siguiente contenido es suministrado por un usuario PXT y no fue aprobado por la Microsoft. Si consideras que no es adecuado, por favor",
  "The content below is provided by a user, and is not endorsed by Microsoft. If you think it's not appropriate, please": "El siguiente contenido fue suministrado por un usuario y no está endosado por la Microsoft. Si consideras que no es apropiado,",
  "The content below is provided by partner.": "El siguiente contenido es suministrado por un colaborador.",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using": "Es posible importar fácilmente para una planilla Excel 2016 los datos almacenados en esta transmisión",
  "Trademarks": "Marcas registradas",
  "TypeScript":"Grafía",
  "URL": "URL",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Actualizar para JavaScript gracias a nuestro rico editor de textos con ayuda contextual, verificación de antecedentes y autocompletar.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"Utilizar PXT para proveer una experiencia suave de programación para tu proyecto, en bloques y JavaScript. Construye las APIs y el tiempo de ejecución y nosotros nos encargaremos de las cosas del editor.",
  "User-provided content": "Contenido suministrado por usuario",
  "Visual Studio Code":"Estudio de código visual",
  "We collect your GitHub user name and will display it together with your libraries.":"Nosotros colectamos tu nombre de usuario del GitHub y lo mostraremos junto con tus bibliotecas.",
  "We'll use your GitHub user name":"Nosotros utilizaremos tu nombre de usuario del GitHub",
  "Why do you find it offensive?": "Por qué encuentras esto ofensivo?",
  "You are now signed out from Programming Experience Toolkit":"Saliste del Kit de herramientas para experiencia de programación",
  "You can go back to": "Puedes volver a",
  "You can still create scripts and":"Todavía puedes crear códigos y",
  "code the micro:bit":"programar la micro:bit",
  "contact us": "contáctanos",
  "explore PXT":"explorar PXT",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg",
  "home page": "Página inicial",
  "micro:bit": "micro:bit",
  "or": "o",
  "pxt.io":"pxt.io",
  "report abuse": "denuncia abuso",
  "search docs...":"buscar documentos...",
  "sign in again":"entrar nuevamente",
  "summary": "resumen",
  "to save scripts to all your devices.":"salvar códigos para todos tus dispositivos.",
  "translucent-black": "negro translúcido",
  "tutorial":"tutorial",
  "view":"visión",
  "website": "site",
  "yes": "sí",
  "© 2017 Microsoft": "Microsoft© 2017 "
}