{
  "radio": "Transmite datos por paquetes de radio",
  "radio.Packet.receivedBuffer": "Retornará o los datos del área de memoria temporaria, si los datos hubiesen sido enviados en este paquete,\no un área de memoria temporaria vacía",
  "radio.Packet.receivedNumber": "Retorna el número que llegue en este paquete, enviado por medio de ``sendNumber()`` (envía número) o de ``sendValue()``(envía par), o 0, si no existe un número en este paquete.",
  "radio.Packet.receivedString": "Retorna la string que llegue en esse paquete enviada por medio de ``SendString()``(envía string) o de ``sendValue()`` (envía par), o una string vacía, si no existe una string en ese paquete.",
  "radio.Packet.serial": "El número de serie del remitente del paquete o 0, si el remitente no hubiese enviado su número de serie.",
  "radio.Packet.signal": "El indicador de intensidad de señal recibida (RSSI) del paquete.",
  "radio.Packet.time": "La hora del sistema del remitente en el momento de envío del paquete.",
  "radio.onDataPacketReceived": "Contiene el código que será ejecutado siempre que la radio reciba un paquete. También retira el paquete recibido de la fila de la radio.",
  "radio.onDataReceived": "Contiene el código que será ejecutado siempre que un paquete sea recibido por la radio.",
  "radio.receiveNumber": "Lee el próximo paquete de la fila de la radio y retorna el número contenido en el paquete o 0, si no existe un número en el paquete.",
  "radio.receiveString": "Lee el próximo paquete de la fila de la radio y retorna la string contenida en el paquete o una string vacía, si no existe una string en el paquete.",
  "radio.receivedBuffer": "Retorna los datos del último paquete retirado de la fila de la radio\n(vía ``númeroRecibido``, ``stringRecibida``, etc) o la string vacía, si no existe una string en el\npaquete.",
  "radio.receivedNumber": " Retorna el número contenido en los datos del último paquete retirado de la fila de la radio\n(vía ``númeroRecibido``, ``stringRecibida``, etc) o 0, si no existe un\n número en aquél paquete",
  "radio.receivedSerial": "Retorna el número de serie de la micro:bit remitente, relativo al último paquete retirado de la fila de la radio (vía ``númeroRecibido``, ``stringRecibida``, etc), o 0, si no existe un número de serie en aquél paquete.",
  "radio.receivedSignalStrength": "Obtiene el indicador de intensidad de señal recibido (RSSI) del último paquete retirado de la fila de la radio (vía ``númeroRecibido``, ``stringRecibida``, etc). No hay soporte en el simulador. namespace=radio",
  "radio.receivedString": "Retorna la string contenida en los datos del último paquete retirado de la fila de la radio\n(vía ``númeroRecibido``, ``stringRecibida``, etc) o 0, si no existe una string en aquél paquete.",
  "radio.receivedTime": "Retorna la hora del sistema de la micro:bit remitente en el momento del envío del último paquete retirado de la fila de la radio (vía ``númeroRecibido``,\n``stringRecibida``, etc).",
  "radio.sendBuffer": "Transmite el contenido de un área de memoria temporaria (de hasta 19 bytes), junto con el número de serie del dispositivo y el tiempo de ejecución, para todas las micro:bits conectadas al grupo.",
  "radio.sendNumber": "Transmite un número por radio para todas las micro:bits conectadas al grupo.",
  "radio.sendString": "Transmite una string, junto con el número de serie del dispositivo y el tiempo de ejecución, para todas las micro:bits conectadas al grupo.",
  "radio.sendValue": "Transmite un par con nombre \/ valor, junto con el número de serie del dispositivo y el tiempo de ejecución, para todas las micro:bits conectadas al grupo.",
  "radio.sendValue|param|name": "el nombre atribuído al valor (máximo de 12 caracteres), por ejemplo: \"nombre\"",
  "radio.sendValue|param|value": "el valor numérico",
  "radio.setGroup": "Define el grupo para las comunicaciones de radio. Una micro:bit sólo puede oir un grupo por vez.",
  "radio.setGroup|param|id": "la identificación del grupo debe estar entre ``0`` y ``255``, por ejemplo: 1",
  "radio.setTransmitPower": "Altera el nivel de la potencia de salida del transmisor para el valor definido.",
  "radio.setTransmitPower|param|power": "un valor en el intervalo de 0 a 7, en el que 0 es a potencia más baja y 7 la más alta. Por ejemplo: 7",
  "radio.setTransmitSerialNumber": "Configura la radio para transmitir el número de serie en cada mensaje.",
  "radio.setTransmitSerialNumber|param|transmit": "valor que indica si el número de serie deberá ser transmitido, por ejemplo: verdadero",
  "radio.writeReceivedPacketToSerial": "Envía el último paquete recibido por la serial en formato JSON. Debe ser llamado de dentro de una función de retorno ``onDataPacketReceived`` (cuando recibida por radio).",
  "radio.writeValueToSerial": "Lee el próximo paquete de la fila de la radio y lo envía por la serial como en formato JSON."
}
