{
  "radio": "Comunicar dados usando pacotes de rádio",
  "radio.onDataPacketReceived": "Registra código para executar quando o rádio recebe um pacote. Também toma o \npacote recebido da fila do rádio.",
  "radio.onDataReceived": "Registra o código para executar quando um pacote é recebido via rádio.",
  "radio.receiveNumber": "Lê o próximo pacote da fila do rádio e retorna o número do pacote\nconteúdo ou 0 se o pacote não continha um número.",
  "radio.receiveString": "Lê o próximo pacote da fila do rádio e retorna a string do pacote\nconteúdo ou uma string vazia se o pacote não continha uma string.",
  "radio.receivedNumber": "Retorna o conteúdo numérico do último pacote retirado da fila do rádio\n(via ``receiveNumber``, ``receiveString``, etc) ou 0 se este pacote não \ncontinha um número.",
  "radio.receivedSerial": "Retorna o número serial da micro:bit transmissora a partir do último pacote retirado\nda fila do rádio (via ``receiveNumber``, ``receiveString``, etc) ou 0 se\neste pacote não enviou um número serial.",
  "radio.receivedSignalStrength": "Obtém o RSSI (received signal strength indicator) do último pacote retirado\nda fila do rádio (via ``receiveNumber``, ``receiveString``, etc). O simulador não suporta esta função.\nnamespace=radio",
  "radio.receivedString": "Retorna o conteúdo de string do último pacote retirado da fila do rádio\n(via ``receiveNumber``, ``receiveString``, etc) ou uma string vazia se este\npacote não continha uma string.",
  "radio.receivedTime": "Retorna o tempo do sistema da micro:bit transmissora no momento em que ela enviou o\núltimo pacote da fila do rádio (via ``receiveNumber``,\n``receiveString``, etc).",
  "radio.sendNumber": "Transmite um número via rádio para qualquer micro:bit conectada ao grupo.",
  "radio.sendString": "Transmite uma string junto ao número serial do dispositivo \ne o tempo de execução para qualquer micro:bit conectada ao grupo.",
  "radio.sendValue": "Transmite um nome / valor junto ao número serial do dispositivo \ne ao tempo de execução para qualquer micro:bit conectada ao grupo.",
  "radio.sendValue|param|name": "nome do campo (máx 12 caracteres), eg: \"name\"",
  "radio.sendValue|param|value": "valor numérico",
  "radio.setGroup": "Define o ID do grupo para comunicações via rádio. Uma micro:bit pode ouvir somente um ID por vez.",
  "radio.setGroup|param|id": "o ID do grupo entre ``0`` e ``255``, eg: 1",
  "radio.setTransmitPower": "Muda a potência da saída do transmissor para o valor especificado.",
  "radio.setTransmitPower|param|power": "um valor no intervalo 0..7, em que 0 é a menor potência e 7 é a maior. eg: 7",
  "radio.setTransmitSerialNumber": "Configura o rádio para transmitir o número serial em cada mensagem.",
  "radio.setTransmitSerialNumber|param|transmit": "valor que indica se o número serial foi transmitido, eg: true",
  "radio.writeReceivedPacketToSerial": "Registra o último pacote recebito para serial como JSON. Isto deve ser chamado \ndentro de uma ``onDataPacketReceived`` função de retorno.",
  "radio.writeValueToSerial": "Lê o próximo pacote a partir da fila do rádio e o registra para serial \ncomo JSON."
}